app/views/sigs/index.html.erb

SELECT `sigs`.* FROM `sigs` ORDER BY `sigs`.`id` ASC LIMIT 1000
---
    <th id='numSigs'><% i = 0%>
		     <% Sig.find_each do |sig| %>

SELECT `edges`.* FROM `edges` ORDER BY `edges`.`id` ASC LIMIT 1000
---
		<th id='numEdges'><% v = 0%>
				  <% Edge.find_each do |edge| %>