app/views/sigs/show.html.erb

	 	<%= f.label :aside %>
		<%= f.collection_select :aside, Sig.all, :id, :title %>
---
SELECT `sigs`.* FROM `sigs`