app/controllers/edges_controller.rb

	def connect
		@edge = Edge.new(params.require(:edge).permit(:aside, :bside))
		@edge.aside -= 1
		@edge.bside -= 1
                @edge.save
---
INSERT INTO `edges` (`aside`, `bside`, `created_at`, `updated_at`) VALUES (3, 4, '2016-04-16 21:41:34', '2016-04-16 21:41:34')