app/controllers/sessions_controller.rb

  def home
	@current_user = User.find(session[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1