app/controllers/sigs_controller.rb

	def like
		@sig = Sig.find(params[:id])
		@sig.likes += 1
		@sig.save
---
SELECT `sigs`.* FROM `sigs` WHERE `sigs`.`id` = 4 LIMIT 1
UPDATE `sigs` SET `likes` = 1, `updated_at` = '2016-04-16 21:43:03' WHERE `sigs`.`id` = 4

	def show
		@sig = Sig.find(params[:id])
---
SELECT `sigs`.* FROM `sigs` WHERE `sigs`.`id` = 1 LIMIT 1

	def create
		@sig = Sig.new(params.require(:sig).permit(:title, :tags, :file, :likes))

		@sig.save
---
INSERT INTO `sigs` (`created_at`, `file`, `likes`, `tags`, `title`, `updated_at`) VALUES ('2016-04-16 21:37:52', 'http://imgur.com/gallery/y0VwU', 0, '', 'patrick', '2016-04-16 21:37:52')