app/controllers/users_controller.rb

	def create
    	@user = User.new(params[:user].permit(:username,:email,:password_confirmation,:password))
    	if @user.save
---
INSERT INTO `users` (`created_at`, `email`, `encrypted_password`, `salt`, `updated_at`, `username`) VALUES ('2016-04-16 22:11:47', 'fuck', '$2a$10$Jo3oUyJsBmAD0BEQpxthqOXLkHpOnb1VA9SksrrzgpviY8cS0Y/Q6', '$2a$10$Jo3oUyJsBmAD0BEQpxthqO', '2016-04-16 22:11:47', 'alek')